{"intro":{"title":"Mới & Gọn nhẹ","parts":["melonJS là một cơ chế phát triển trò chơi HTML5 mã nguồn mở giúp các nhà phát triển và nhà thiết kế tập trung vào nội dung.","Framework này cung cấp một bộ các thực thể và hỗ trợ khả thi cho nhiều công cụ bên thứ ba.. Mang đến cho bạn một sự kết hợp mạnh mẽ để có thể sử dụng toàn bộ hoặc từng phần."]},"benefits":[{"title":"Nhanh","summary":"Xây dựng với công nghệ tương lai.","reasons":["WebGL","WebAudio","ES6 Collections"]},{"title":"Miễn phí","summary":"Phát hành dưới giấy phép MIT đã được cấp phép.","reasons":["Không tốn phí.","Miễn phí bản quyền.","Mãi mãi."]},{"title":"Sang trọng","summary":"Đồ thị cảnh chơi của bạn là một hệ thống cấp bậc các container.","reasons":["Đồ thị cảnh chơi của bạn là một hệ thống cấp bậc các container.","Các bản cập nhật và hoạt động đồ họa được phát hành riêng biệt.","Đồ họa là tùy chọn; thêm các thực thể tạo bởi máy tính cho AI, các hiệu ứng đặc biệt, v.v..."]}],"powerful":{"title":"Thiết Kế Màn Chơi Mạnh Mẽ","description":"melonJS tích hợp định dạng bản đồ Tiled (chia ô) phổ biến, cho phép các nhà thiết kế dễ dàng tạo các màn chơi bằng cách dùng Công cụ chỉnh sửa bản đồ Tiled, và tập trung vào các tính năng trò chơi."},"spotlight":{"title":"Nhà phát triển tiêu biểu"},"features":{"title":"Tính năng","list":["Một cơ chế dựa trên sprite 2D mới và gọn nhẹ","Thư viện độc lập (không có phụ thuộc)","Các tính năng HTML5 hiện đại; WebGL & WebAudio","Web Audio support with fallback to Multi-channel HTML5 audio","DPI cao & tự động canh chỉnh chế độ video phù hợp","Các hiệu ứng Tween & Chuyển tiếp","Vật lý 2D với yêu cầu cpu thấp:",["Thuật toán va chạm dựa trên đa giác (SAT) cho phát hiện và phản hồi chính xác","Phát hiện nhanh va chạm giai đoạn rộng bằng cách sử dụng phân vùng không gian","API toán học nâng cao cho Vector và Ma trận","3rd party tools support for physic body definition (PhysicEditor, Physic Body Editor)"],"Bộ Thực thể Đối tượng mở rộng cơ bản:",["Kho đối tượng","Hệ thống Hạt cơ bản","Quản lý chuyển động hoạt hình cơ bản","Bảng sprite cơ bản và hỗ trợ Kết cấu đóng gói","Một số yếu tố Giao diện đồ họa người dùng (GUI) cơ bản"],"Tích hợp định dạng bản đồ chia ô cho thiết kế màn chơi dễ dàng:",["Hỗ trợ bản đồ chia ô Trực giao, Đẳng số, Lục giác và Phối cảnh","Đa lớp với hiệu ứng di chuyển cuộn song song","Các lớp va chạm dựa trên hình dạng (Hình chữ nhật, Elip, Đa giác và Đường đa giác)","Định dạng JSON và XML"],"Font Hệ thống và Bitmap","Trình quản lý trạng thái và trình tải tùy chỉnh","Hỗ trợ Chuột, Chạm, Con trỏ và thiết bị Gamepad","Hỗ trợ chuyển động, định hướng và gia tốc thiết bị","Built-in support for 3rd party Application Wrappers such as","As light as"]},"compatibility":{"title":"Tính tương thích","description":"melonJS làm việc với bất kỳ trình duyệt tương thích ES5 đầy đủ"}}